In [49]:
import pandas as pd

# Load the Titanic dataset
df = pd.read_csv('/content/titanic (1).csv')

In [50]:
# Display the first few rows of the dataset
print(df.head())

   PassengerId  Survived  Pclass      Lname  \
0            1         0       3     Braund
1            2         1       1    Cumings
2            3         1       3  Heikkinen
3            4         1       1   Futrelle
4            5         0       3      Allen

                                          Name     Sex   Age  SibSp  Parch  \
0                              Mr. Owen Harris    male  22.0      1      0
1   Mrs. John Bradley (Florence Briggs Thayer)  female  38.0      1      0
2                                  Miss. Laina  female  26.0      0      0
3           Mrs. Jacques Heath (Lily May Peel)  female  35.0      1      0
4                            Mr. William Henry    male  35.0      0      0

             Ticket     Fare Cabin Embarked
0         A/5 21171   7.2500   NaN        S
1          PC 17599  71.2833   C85        C
2  STON/O2. 3101282   7.9250   NaN        S
3            113803  53.1000  C123        S
4            373450   8.0500   NaN        S

In [51]:
#summary statistics
print(df.describe())

       PassengerId    Survived      Pclass         Age       SibSp  \
count   156.000000  156.000000  156.000000  126.000000  156.000000
mean     78.500000    0.346154    2.423077   28.141508    0.615385
std      45.177428    0.477275    0.795459   14.613880    1.056235
min       1.000000    0.000000    1.000000    0.830000    0.000000
25%      39.750000    0.000000    2.000000   19.000000    0.000000
50%      78.500000    0.000000    3.000000   26.000000    0.000000
75%     117.250000    1.000000    3.000000   35.000000    1.000000
max     156.000000    1.000000    3.000000   71.000000    5.000000

            Parch        Fare
count  156.000000  156.000000
mean     0.397436   28.109587
std      0.870146   39.401047
min      0.000000    6.750000
25%      0.000000    8.003150
50%      0.000000   14.454200
75%      0.000000   30.371850
max      5.000000  263.000000

In [52]:
# Check missing values
print(df.isnull().sum())

PassengerId      0
Survived         0
Pclass           0
Lname            0
Name             0
Sex              0
Age             30
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          125
Embarked         1
dtype: int64

In [53]:
# Data types of columns
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 156 entries, 0 to 155
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  156 non-null    int64
 1   Survived     156 non-null    int64
 2   Pclass       156 non-null    int64
 3   Lname        156 non-null    object
 4   Name         156 non-null    object
 5   Sex          156 non-null    object
 6   Age          126 non-null    float64
 7   SibSp        156 non-null    int64
 8   Parch        156 non-null    int64
 9   Ticket       156 non-null    object
 10  Fare         156 non-null    float64
 11  Cabin        31 non-null     object
 12  Embarked     155 non-null    object
dtypes: float64(2), int64(5), object(6)
memory usage: 16.0+ KB
None

In [54]:
if df['Age'].notna().any():
    df['Age'] = df['Age'].fillna(df['Age'].median())
    df = df.infer_objects(copy=False)
else:
    print("Warning: 'Age' column is entirely NaN.")

In [55]:
df['Age'].fillna(df['Age'].median(), inplace=True)
df['Embarked'].fillna(df['Embarked'].mode()[0], inplace=True)
df.drop(columns=['Cabin'], inplace=True)

In [56]:
df = df.dropna(subset=['Fare'])

In [57]:
df['Sex'] = df['Sex'].map({'male': 0, 'female': 1})

In [58]:
df = pd.get_dummies(df, columns=['Embarked'], drop_first=True)

In [59]:
df['FamilySize'] = df['SibSp'] + df['Parch'] + 1

In [60]:
df['IsAlone'] = (df['FamilySize'] == 1).astype(int)

In [61]:
df.drop(columns=['Name', 'Ticket', 'PassengerId'], inplace=True)

In [62]:
print(df.head())

   Survived  Pclass      Lname  Sex   Age  SibSp  Parch     Fare  Embarked_Q  \
0         0       3     Braund    0  22.0      1      0   7.2500       False
1         1       1    Cumings    1  38.0      1      0  71.2833       False
2         1       3  Heikkinen    1  26.0      0      0   7.9250       False
3         1       1   Futrelle    1  35.0      1      0  53.1000       False
4         0       3      Allen    0  35.0      0      0   8.0500       False

   Embarked_S  FamilySize  IsAlone
0        True           2        0
1       False           2        0
2        True           1        1
3        True           2        0
4        True           1        1